cmsis-svd/cmsis-svd/data/MindMotion/MM32L3xx.svd
        <register>
          <name>CLR_START_DET</name>
          <displayName>CLR_START_DET</displayName>
          <description>CLR_START_DET</description>
          <addressOffset>0x64</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x000</resetValue>
          <fields>
            <field>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <name>CLR_START_DET</name>
              <description>Read this register to clear the START_DET interrupt(bit 10)of the IC_RAW_INTR_STAT register</description>
            </field>
          </fields>
        </register>
        <register>
          <name>CLR_GEN_CALL</name>
          <displayName>CLR_GEN_CALL</displayName>
          <description>CLR_GEN_CALL</description>
          <addressOffset>0x68</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x000</resetValue>
          <fields>
            <field>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <name>CLR_GEN_CALL</name>
              <description>Read this register to clear the GEN_CALL interrupt(bit 11)of the IC_RAW_INTR_STAT register</description>
            </field>
          </fields>
        </register>
        <register>
          <name>ENABLE</name>
          <displayName>ENABLE</displayName>
          <description>ENABLE</description>
          <addressOffset>0x6C</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x000</resetValue>
          <fields>
            <field>
              <name>ABORT</name>
              <description>I2C transfer abort</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ENABLE</name>
              <description>I2C mode enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>STATUS</name>
          <displayName>STATUS</displayName>
          <description>STATUS</description>
          <addressOffset>0x70</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x006</resetValue>
          <fields>
            <field>
              <name>SLV_ACTIVITY</name>
              <description>Slave FSM activity status</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>MST_ACTIVITY</name>
              <description>Master FSM activity status</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RFF</name>
              <description>Receive FIFO completely full</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RFNE</name>
              <description>Receive FIFO not empty</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TFE</name>
              <description>Transmit FIFO completely empty</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TFNF</name>
              <description>Transmit FIFO not full</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ACTIVITY</name>
              <description>I2C activity status</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>TXFLR</name>
          <displayName>TXFLR</displayName>
          <description>TXFLR</description>
          <addressOffset>0x74</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x006</resetValue>
          <fields>
            <field>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <name>TXFLR</name>
              <description>Transmit FIFO level.Contains the number of valid data entires in the transmit FIFO</description>
            </field>
          </fields>
        </register>
        <register>
          <name>RXFLR</name>
          <displayName>RXFLR</displayName>
          <description>RXFLR</description>
          <addressOffset>0x78</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x006</resetValue>
          <fields>
            <field>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <name>RXFLR</name>
              <description>Receive FIFO level. Contains the number of valid data entires in the receive FIFO</description>
            </field>
          </fields>
        </register>        
        <register>
          <name>SDA_HOLD</name>
          <displayName>SDA_HOLD</displayName>
          <description>SDA_HOLD</description>
          <addressOffset>0x7C</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x0001</resetValue>
          <fields>
            <field>
              <name>IC_SDA_RX_HOLD</name>
              <description>Sets the required SDA hold time in units of ic_clk period</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
            <field>
              <name>IC_SDA_TX_HOLD</name>
              <description>Sets the required SDA hold time in units of ic_clk period</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>DMA_CR</name>
          <displayName>DMA_CR</displayName>
          <description>DMA_CR</description>
          <addressOffset>0x88</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <fields>
            <field>
              <name>TDMAE</name>
              <description>Transmit DMA enable</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RDMAE</name>
              <description>Receive DMA enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>     
        <register>
          <name>SDA_SETUP</name>
          <displayName>SDA_SETUP</displayName>
          <description>SDA_SETUP</description>
          <addressOffset>0x94</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x0064</resetValue>
          <fields>
            <field>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <name>SDA_SETUP</name>
              <description>SDA setup</description>
            </field>
          </fields>
        </register>
        <register>
          <name>ACK_GENERAL_CALL</name>
          <displayName>ACK_GENERAL_CALL</displayName>
          <description>ACK_GENERAL_CALL</description>
          <addressOffset>0x98</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x0001</resetValue>
          <fields>
            <field>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <name>ACK_GEN_CALL</name>
              <description>ACK general call</description>
            </field>
          </fields>
        </register>
