cmsis-svd/cmsis-svd/data/MindMotion/MM32L3xx.svd
        <register>
          <name>EP2_CTRL</name>
          <displayName>EP2_CTRL</displayName>
          <description>EP2_CTRL</description>
          <addressOffset>0x148</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <fields>
            <field>
              <name>TRANEN</name>
              <description>EP2 transfer enable</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TRANCOUNT</name>
              <description>EP2 transfer counter</description>
              <bitOffset>0</bitOffset>
              <bitWidth>7</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>EP3_CTRL</name>
          <displayName>EP3_CTRL</displayName>
          <description>EP3_CTRL</description>
          <addressOffset>0x14c</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <fields>
            <field>
              <name>TRANEN</name>
              <description>EP3 transfer enable</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TRANCOUNT</name>
              <description>EP3 transfer counter</description>
              <bitOffset>0</bitOffset>
              <bitWidth>7</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>EP4_CTRL</name>
          <displayName>EP4_CTRL</displayName>
          <description>EP4_CTRL</description>
          <addressOffset>0x150</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <fields>
            <field>
              <name>TRANEN</name>
              <description>EP4 transfer enable</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TRANCOUNT</name>
              <description>EP4 transfer counter</description>
              <bitOffset>0</bitOffset>
              <bitWidth>7</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>EP0_FIFO</name>
          <displayName>EP0_FIFO</displayName>
          <description>EP0_FIFO</description>
          <addressOffset>0x160</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <fields>
            <field>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <name>EP0_FIFO</name>
              <description>EP0 FIFO port</description>
            </field>
          </fields>
        </register>
        <register>
          <name>EP1_FIFO</name>
          <displayName>EP1_FIFO</displayName>
          <description>EP1_FIFO</description>
          <addressOffset>0x164</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <fields>
            <field>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <name>EP1_FIFO</name>
              <description>EP1 FIFO port</description>
            </field>
          </fields>
        </register>
        <register>
          <name>EP2_FIFO</name>
          <displayName>EP2_FIFO</displayName>
          <description>EP2_FIFO</description>
          <addressOffset>0x168</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <fields>
            <field>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <name>EP2_FIFO</name>
              <description>EP2 FIFO port</description>
            </field>
          </fields>
        </register>
        <register>
          <name>EP3_FIFO</name>
          <displayName>EP3_FIFO</displayName>
          <description>EP3_FIFO</description>
          <addressOffset>0x16c</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <fields>
            <field>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <name>EP3_FIFO</name>
              <description>EP3 FIFO port</description>
            </field>
          </fields>
        </register>
        <register>
          <name>EP4_FIFO</name>
          <displayName>EP4_FIFO</displayName>
          <description>EP4_FIFO</description>
          <addressOffset>0x170</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <fields>
            <field>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <name>EP4_FIFO</name>
              <description>EP4 FIFO port</description>
            </field>
          </fields>
        </register>
        <register>
          <name>EP_DMA</name>
          <displayName>EP_DMA</displayName>
          <description>EP_DMA</description>
          <addressOffset>0x184</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <fields>
            <field>
              <name>DMA2EN</name>
              <description>EP2 DMA enable</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>DMA1EN</name>
              <description>EP1 DMA enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>EP_HALT</name>
          <displayName>EP_HALT</displayName>
          <description>EP_HALT</description>
          <addressOffset>0x188</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <fields>
            <field>
              <name>HALT4</name>
              <description>EP4 halt</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>HALT3</name>
              <description>EP3 halt</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>HALT2</name>
              <description>EP2 halt</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>HALT1</name>
              <description>EP1 halt</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>HALT0</name>
              <description>EP0 halt</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
      </registers>
    </peripheral>
  </peripherals>
</device>
